# Pandas

- 파이썬에서 사용하는 데이터분석 라이브러리
- 행과 열로 이루어진 데이터 객체를 만들 수 있음
- 크게 두가지 데이터 타입이 있음 <br><br>
#### Series
- Index와 Value로 이루어진 데이터 타입 <br><br>
#### DataFrame
- Index와 Value와 Column으로 이루어진 데이터 타입
- Column은 Series로 이루어짐
- 엑셀의 테이블 형태과 유사함

In [1]:
import numpy as np
import pandas as pd
pd.set_option('display.max_columns', None)
pd.set_option('display.max_rows', None)

import warnings
warnings.filterwarnings(action='ignore')

---

## 1. Series

### 1-1. 시리즈 생성 - 2가지

(1) 값만 넣기

이 경우, index는 자동으로 숫자

In [2]:
series1 = pd.Series([1, 6, 7, 3])
series1

0    1
1    6
2    7
3    3
dtype: int64

(2) 딕셔너리로 생성

이 경우, 인덱스도 한 번에 원하는 것으로 설정할 수 있다.

In [3]:
series2 = pd.Series({'A' : 90, 'B' : 80, 'C' : 70, 'D': 60})
series2

A    90
B    80
C    70
D    60
dtype: int64

### 1-2. 간단한 확인 메소드

In [4]:
# 값만 확인
series1.values

array([1, 6, 7, 3])

In [5]:
# 인덱스 확인
series1.index

RangeIndex(start=0, stop=4, step=1)

In [6]:
# 자료형 확인
series1.dtypes

dtype('int64')

In [7]:
# 시리즈 이름, 인덱스 이름 설정 가능
series2.name = '학점 기준'
series2.index.name = '학점'
series2

학점
A    90
B    80
C    70
D    60
Name: 학점 기준, dtype: int64

### 1-3. 인덱스 심화

In [8]:
# 인덱스 변경 가능
series1.index = ['W', 'X', 'Y', 'Z']
series1

W    1
X    6
Y    7
Z    3
dtype: int64

In [9]:
series1.index

Index(['W', 'X', 'Y', 'Z'], dtype='object')

#### 인덱싱 방법

(1) 인덱스로 인덱싱 - 2가지 방법

In [10]:
# 1.<index 이름>
series2.A

90

In [11]:
# 2. ['<index 이름>']
series2['A']

90

In [12]:
#여러개 한꺼번에 인덱싱 가능
series2[['A', 'C']]

학점
A    90
C    70
Name: 학점 기준, dtype: int64

In [13]:
# offset index를 사용 가능
series2[0:3]

학점
A    90
B    80
C    70
Name: 학점 기준, dtype: int64

### 1-4. Data filtering

In [14]:
# 데이터 필터링
series2[series2 >= 80]

학점
A    90
B    80
Name: 학점 기준, dtype: int64

### 1-5. Series끼리 연산 가능

In [15]:
# series끼리 연산 가능
series1 = pd.Series([1, 2, 3, 4])
series2 = pd.Series([5, 6, 7, 8])

series1 / series2

0    0.200000
1    0.333333
2    0.428571
3    0.500000
dtype: float64

---

## 2. DataFrame

column : 열(세로) / row : 행(가로)

### 2-1. 데이터프레임 생성

In [16]:
df1 = pd.DataFrame(columns=["Food", "Price"])
df1

Empty DataFrame
Columns: [Food, Price]
Index: []

In [17]:
# 리스트로 생성
df1["Food"] = ["마라샹궈", "마라탕","밥"]
df1["Price"] = [15000, 8000,1000]
df1

   Food  Price
0  마라샹궈  15000
1   마라탕   8000
2     밥   1000

In [18]:
# 딕셔너리로 생성
food = ["꿔바로우", "순대국밥"]
price = [16000, 8000]
dic = {"Food":food, "Price":price}
df2 = pd.DataFrame(dic, index=['A','B'])
df2

   Food  Price
A  꿔바로우  16000
B  순대국밥   8000

In [19]:
# 칼럼을 인덱스로 설정
df2.set_index("Food")

      Price
Food
꿔바로우  16000
순대국밥   8000

### 2-2. 데이터프레임 인덱싱

In [20]:
df2

   Food  Price
A  꿔바로우  16000
B  순대국밥   8000

In [21]:
# loc을 통해 인덱스로 접근
df2.loc["B"]

Food     순대국밥
Price    8000
Name: B, dtype: object

In [22]:
# iloc을 통해 인덱스 자리수로 접근 (0부터 시작)
df2.iloc[1]

Food     순대국밥
Price    8000
Name: B, dtype: object

In [23]:
# 컬럼이름으로 접근
df2['Food']

A    꿔바로우
B    순대국밥
Name: Food, dtype: object

In [24]:
# 조건으로 접근
df2[df2.Price > 10000]

   Food  Price
A  꿔바로우  16000

### 2-3. 데이터프레임 추가, 삭제

#### 추가

In [25]:
df1

   Food  Price
0  마라샹궈  15000
1   마라탕   8000
2     밥   1000

In [26]:
# loc을 이용해 추가
df1.loc[2] = ["양꼬치", "12000"]
df1

   Food  Price
0  마라샹궈  15000
1   마라탕   8000
2   양꼬치  12000

##### Row 삭제

In [27]:
# drop을 통해 삭제, default는 axis=0(row)
df1_ = df1.drop(1)
df1_

   Food  Price
0  마라샹궈  15000
2   양꼬치  12000

In [28]:
df1

   Food  Price
0  마라샹궈  15000
1   마라탕   8000
2   양꼬치  12000

In [29]:
df1_

   Food  Price
0  마라샹궈  15000
2   양꼬치  12000

In [30]:
# 해당 데이터프레임에서 삭제하는 방법
df1.drop(1, inplace=True)
df1

   Food  Price
0  마라샹궈  15000
2   양꼬치  12000

In [31]:
# reset_index를 통해 인덱스 재정렬
# 옵션이 없을 시에는 삭제된 index도 따로 index라는 column으로 저장됨
df1__ = df1.reset_index()
df1__

   index  Food  Price
0      0  마라샹궈  15000
1      2   양꼬치  12000

In [32]:
# 다음과 같이 실행하면 저장하지 않음
df1 = df1.reset_index(drop=True)
df1

   Food  Price
0  마라샹궈  15000
1   양꼬치  12000

##### Column 삭제

In [33]:
# axis=1 로 하면 칼럼 삭제
df1__.drop("Price", axis=1)

   index  Food
0      0  마라샹궈
1      2   양꼬치

#### Concat

In [34]:
df1

   Food  Price
0  마라샹궈  15000
1   양꼬치  12000

In [35]:
df2

   Food  Price
A  꿔바로우  16000
B  순대국밥   8000

In [36]:
# concat으로 이어붙일 수 있음
# default는 axis=0
df3 = pd.concat([df1, df2])
df3

   Food  Price
0  마라샹궈  15000
1   양꼬치  12000
A  꿔바로우  16000
B  순대국밥   8000

In [37]:
# axis=1로 수평축으로
df4 = pd.concat([df2, df2], axis=1)
df4

   Food  Price  Food  Price
A  꿔바로우  16000  꿔바로우  16000
B  순대국밥   8000  순대국밥   8000

#### merge

In [38]:
df3

   Food  Price
0  마라샹궈  15000
1   양꼬치  12000
A  꿔바로우  16000
B  순대국밥   8000

In [39]:
df5 = pd.DataFrame({'Food': ['마라샹궈', '초밥', '부대찌개', '순대국밥'], 
                    'Country': ['중국', '일본', '한국', '한국']})
df5

   Food Country
0  마라샹궈      중국
1    초밥      일본
2  부대찌개      한국
3  순대국밥      한국

In [40]:
# inner로 하면 key값이 둘 다 있는 것만
pd.merge(df3, df5, how='inner', on='Food')

   Food  Price Country
0  마라샹궈  15000      중국
1  순대국밥   8000      한국

In [41]:
# outer로 하면 key값이 한 데이터프레임에만 있어도 병합
pd.merge(df3, df5, how='outer', on='Food')

   Food  Price Country
0  마라샹궈  15000      중국
1   양꼬치  12000     NaN
2  꿔바로우  16000     NaN
3  순대국밥   8000      한국
4    초밥    NaN      일본
5  부대찌개    NaN      한국

In [42]:
# left로 하면 왼쪽에 있는 데이터 프레임의 'on' 기준
pd.merge(df3, df5, how='left', on='Food')

   Food  Price Country
0  마라샹궈  15000      중국
1   양꼬치  12000     NaN
2  꿔바로우  16000     NaN
3  순대국밥   8000      한국

In [43]:
# right로 하면 오른쪽에 있는 데이터 프레임의 'on' 기준
pd.merge(df3, df5, how='right', on='Food')

   Food  Price Country
0  마라샹궈  15000      중국
1    초밥    NaN      일본
2  부대찌개    NaN      한국
3  순대국밥   8000      한국

### 2-5. 데이터 읽기, 저장

In [44]:
# 데이터 읽기
# 절대 경로
titanic = pd.read_csv('titanic.csv')
titanic = pd.read_csv('C:/Users/kiyj1/OneDrive - 연세대학교 (Yonsei University)/문서/YBIGTA/pandas_numpy_신입교육세션/titanic.csv')

FileNotFoundError: [Errno 2] No such file or directory: 'titanic.csv'

In [ ]:
# head를 통해 데이터 맨 앞부분 확인
# 기본 5개
titanic.head()

In [ ]:
# shape를 통해 데이터의 row, column 길이 확인 가능
titanic.shape

In [ ]:
# tail을 통해 데이터 뒷부분 확인
# 기본 5개
titanic.tail()

In [ ]:
# 디폴트는 5개지만 보려는 갯수를 조정할 수 있음
# display를 사용해 print처럼 확인 가능

display(titanic.head(2))
display(titanic.tail(2))

In [ ]:
# info를 통해 nan과 데이터 타입, 전체 데이터 수 등 확인 가능
titanic.info()

In [ ]:
# 데이터 타입 변경 가능
titanic.Survived = titanic.Survived.astype('object')

In [ ]:
titanic.info()

In [ ]:
# describe를 이용하여 통계값 확인 (단, 수치형만)
titanic.describe()

In [ ]:
# 컬럼명 확인
titanic.columns

In [ ]:
# 불러오는 설정을 달리해서 가져올 수 있음
titanic2= pd.read_csv("titanic.csv", 
                      usecols=["PassengerId","Age", "Survived"], 
                      nrows=10,
                     index_col="PassengerId")
titanic2

In [ ]:
# 다시 저장하기
titanic2.to_csv("titanic2.csv", index=False)

# index=False를 하지 않으면 인덱스까지 새로운 컬럼(Unnamed: 0)으로 저장됨
# 이 경우, 인덱스인 PassengerId column이 저장
titanic2.to_csv("titanic3.csv")

---

### 2-6. 판다스 함수

#### apply

In [ ]:
titanic.head(2)

In [ ]:
# apply를 이용해 함수를 적용할 수 있음
def is_adult(age):
    if age < 20 :
        return 'not adult'
    if age >= 20 :
        return 'adult'

In [ ]:
titanic['is_adult'] = titanic['Age'].apply(is_adult)
titanic.tail()

#### lambda

In [ ]:
# lambda 함수를 통해서도 쓸 수 있음
# 파이썬은 lambda와 리스트 컴프리헨션을 잘 써야 처리 속도가 빠르므로
# apply는 항상 lambda와 쓰시기를 추천합니다
titanic['is_adult'] = titanic['Age'].apply(lambda x: 'adult' if x< 20 else 'not_adult')
titanic.head()

#### sort

In [ ]:
# 원하는 칼럼을 선택해 그것을 기준으로 오름차순 정렬
titanic.sort_values('Pclass').head()

In [ ]:
# ascending=False로 하면 내림차순
titanic.sort_values('Pclass', ascending=False).head()

#### isnull

In [ ]:
titanic.info()

In [ ]:
# null 값 확인
titanic[titanic["Age"].isnull()]

In [ ]:
# null 값 아닌 것 확인
titanic[titanic["Age"].notnull()]

#### dropna

In [ ]:
# 결측치 제거
# titanic.dropna(inplace=True)
titanic_notnull = titanic.dropna()

#titanic_notnull = titanic.dropna(axis=1) 하면
# null 값인 column 자체를 다 삭제할 수 있음.
titanic_notnull[titanic_notnull['Age'].isnull()]

#### unique

In [ ]:
titanic.head()

In [ ]:
# unique값이 뭔지 확인
titanic.Embarked.unique()

#### value_counts

In [ ]:
# unique값들이 각각 얼마나 있는지 확인
titanic.Survived.value_counts()

#### groupby

In [ ]:
titanic_sample = titanic[['Name', 'Age', 'Pclass', 'Fare', 'Sex']]
titanic_sample.head()

In [ ]:
# size를 통해 해당 칼럼을 모은 후 개수 확인
titanic_sample.groupby("Pclass").size()

In [ ]:
# 두가지 기준으로 groupby한 후에 개수도 확인 가능
titanic_sample.groupby(["Pclass", "Sex"]).size()

In [ ]:
# groupby로 모은 후 agg를 통해 다양한 통계를 낼 수 있음(min, max, mean, sum, median)
# 이상치가 있네요 이런 것은 나중에 EDA 과정에서 제거해야 됩니다
titanic_sample.groupby("Pclass").agg((["min","max","mean"]))

*참고한 문헌: https://www.flearning.net/courses/6
(주소 이전으로 접속이 안되네요)